app/Controllers/LaboursController.php

SELECT `melamar`.*, `pekerjaan`.`jenisPekerjaan`, `pekerjaan`.`deskripsiPekerjaan`, `pekerjaan`.`waktuPekerjaan`
FROM `melamar`
JOIN `pekerjaan` ON `pekerjaan`.`kodePekerjaan` = `melamar`.`kodePekerjaan`
WHERE `nik` = '8212313'
SELECT `melamar`.*, `pekerjaan`.`jenisPekerjaan`, `pekerjaan`.`deskripsiPekerjaan`, `pekerjaan`.`waktuPekerjaan`, `pekerjaan`.`sampul`
FROM `melamar`
JOIN `pekerjaan` ON `pekerjaan`.`kodePekerjaan` = `melamar`.`kodePekerjaan`
WHERE `nik` = '8212313'
---
    public function postinganSaya()
    {
        $nik = session()->get('nik');
        $data = [
            'title' => 'Post | Labours',
            'dataMelamar' => $this->modelMelamar
                ->select(['melamar.*',' pekerjaan.jenisPekerjaan', 'pekerjaan.deskripsiPekerjaan', 'pekerjaan.waktuPekerjaan', 'pekerjaan.sampul'])
                ->join('pekerjaan', 'pekerjaan.kodePekerjaan = melamar.kodePekerjaan')
                ->where(['nik' => $nik])
                ->findAll(),
        ];