app/Models/LaboursModel.php

    public function getPekerjaan($kode)
    {
        return $this->where(['kodePekerjaan' => $kode])->first();
---
SELECT *
FROM `pekerjaan`
WHERE `kodePekerjaan` = '109'
 LIMIT 1